# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: :changed
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Command-line fuzzy finder written in Go
brew "fzf"
# Zsh prompt theme
brew "powerlevel10k"
# Fish-like autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish-like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# GitHub command-line tool
brew "gh"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Rsync for cloud storage
brew "rclone"
# Fast, efficient and secure backup program
brew "restic"
# General-purpose lossless data-compression library
brew "zlib"
# Required to build ruby
brew "libyaml"
# For terminal and coding
cask "font-hack-nerd-font"

vscode "ms-vscode-remote.remote-containers"
